{
  "_name_or_path": "deepseek-ai/DeepSeek-R1-Distill-Qwen-14B",
  "architectures": [
    "Qwen2ForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 151646,
  "eos_token_id": 151643,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 13824,
  "max_position_embeddings": 131072,
  "max_window_layers": 48,
  "model_type": "qwen2",
  "num_attention_heads": 40,
  "num_hidden_layers": 48,
  "num_key_value_heads": 8,
  "pad_token_id": 151654,
  "quantization_config": {
    "_load_in_4bit": true,
    "_load_in_8bit": false,
    "bnb_4bit_compute_dtype": "bfloat16",
    "bnb_4bit_quant_storage": "uint8",
    "bnb_4bit_quant_type": "nf4",
    "bnb_4bit_use_double_quant": true,
    "llm_int8_enable_fp32_cpu_offload": false,
    "llm_int8_has_fp16_weight": false,
    "llm_int8_skip_modules": [
      "lm_head",
      "multi_modal_projector",
      "merger",
      "modality_projection",
      "model.layers.0.self_attn",
      "model.layers.0.mlp",
      "model.layers.1.self_attn",
      "model.layers.1.mlp",
      "model.layers.2.self_attn",
      "model.layers.2.mlp",
      "model.layers.3.self_attn",
      "model.layers.3.mlp",
      "model.layers.4.self_attn",
      "model.layers.4.mlp",
      "model.layers.5.mlp",
      "model.layers.6.mlp",
      "model.layers.26.mlp",
      "model.layers.43.mlp",
      "model.layers.44.mlp",
      "model.layers.45.mlp",
      "model.layers.46.mlp",
      "model.layers.23.self_attn.o_proj",
      "model.layers.47.self_attn.o_proj"
    ],
    "llm_int8_threshold": 6.0,
    "load_in_4bit": true,
    "load_in_8bit": false,
    "quant_method": "bitsandbytes"
  },
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 1000000.0,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.49.0.dev0",
  "unsloth_fixed": true,
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 152064
}
